{
    "Beacon": "A special innocent who receives buffs as other innocents are killed and their deaths are confirmed. Beacon becomes a normal Innocent if they kill another Innocent.",
    "Bodyguard": "Assigned random player to protect. BodyGuard is hurt upon death of assigned player and takes excessive damage when attacking them.",
    "Cupid": "Uses a crossbow to soulbind two players (who then take damage together and die together). (Binding fails [without explanation] if anyone has already died during match). Cupid can bind themself to someone by right clicking with the crossbow. If soulbound players are on different teams, they join team Lovers and win when only they remain",
    "Glutton": "A traitor who grows hungry as the round progresses. Using their special weapon, Devour, lets them restore Hunger and regain health as they deal damage. They can eat bodies to refill their Hunger. As Hunger increases through the stages of Hungry, Starving, Insatiable, and Ravenous, the Glutton gets more powerful while using Devour. Once Insatiable, the Glutton leaves a blood trail and can only use Devour. If the Glutton becomes Ravenous, they enter their own team and must be the last one standing. They also constantly take damage and receive a massive speed and damage boost, and all players are alerted to their Ravenous state.",
    "Ravenous": "A lonely beast resulting from an overly hungry Glutton. They have entered their own team and must be the last one standing. They constantly take damage and receive a massive speed and damage boost, and all players are alerted to their Ravenous state.",
    "Hitman": "A special traitor who starts with no credits. Receives credits for killing the assigned target player. The Hitman still wants to kill all non-traitors, and can do so regardless of the order of assigned target",
    "Infected": "Any player killed by the Infected will respawn as another Infected. If the host Infected dies, all Infected die.",
    "Jackal": "Fights alone but can recruit any one player to their team by shooting them with the Sidekick Deagle.",
    "Sidekick": "Fights alongside the Jackal and is recruited via a shot from the Jackal's Sidekick Deagle. If the Jackal dies, the Sidekick becomes the Jackal and gets the deagle.",
    "Jester": "Only wins when killed by another player. Deals no damage (and takes no fall damage), and should be careful about letting people find this out.",
    "Mesmerist": "Special traitor who has a Defibrillator that allows them to revive players as Thralls (Traitors).",
    "Thrall": "A normal traitor who has been summoned by the Mesmerist (who revived a corpse with their special defibrillator).]",
    "Necromancer": "A villain on its own team who can revive players with a special Defibrillator (The number of charges correlates to the number of players). Players revive as slow Zombies with limited ammo in a deagle. Upon firing their final shot, the zombie dies.",
    "Zombie": "A slow Zombie that has been revived from a corpse by the Necromancer. Zombies have limited ammo in their deagles and when they run out, they die.",
    "Occultist": "An innocent who, when killed (so long as their HP dipped below 25 at some point this life), will be engulfed in flames and then respawn once. All nearby are notified. Invincible to fire.",
    "Restless": "A villain on its own team who must kill everyone else to win. The Restless has 6 lives and will respawn as long as they have more (and as long as their death does not immediately end the round--there must be another traitor alive for the Restless to respawn). With each subsequent respawn, they are weaker and take longer to respawn.",
    "Pharaoh": "The Pharaoh starts with an Ankh which can be placed and heals the Pharaoh when near (and allows the Pharaoh to respawn when killed). Once tha Ankh is placed, a random Traitor will become the Graverobber [Traitor Team], a traitor who must steal the Ankh. If stolen, the Graverobber will respawn when killed.",
    "Graverobber": "A traitor who has been converted randomly due to the Pharoah placing an Ankh. The Graverobber can steal the Ankh.",
    "Serialkiller": "A villain on its own team who spawns with a tracker and can see all other players at all times. Spawns with 1 credit (more can be obtained from bodies) and a knife.",
    "Accomplice": "A traitor who does not know the identities of the other traitors, though the other traitors know the Accomplice.",
    "Defective": "A traitor who looks like and acts like the detective. Has detective shop. The defective and the detective can deal no damage to each other until only they remain. During a round with a Defective, both the Detective and the Defective can not inspect bodies.",
    "Sheriff": "A special Detective who has a Deputy Deagle which can convert any one player to the Sheriff's Deputy, another detective.",
    "Deputy": "A special Detective who has been converted to the role by a shot from the Sheriff's Deputy Deagle. If the Sheriff dies, the Deputy dies as well.",
    "Shinigami": "Rarely, the apparently normal Innocent role is secretly the Shinigami role. After the Innocent player dies, they respawn as the Shinigami: A very fast and rapidly dying player whose only goal is to quickly kill all traitors so that the Innocent team may win.",
    "Sniffer": "A special Detective who can see footsteps left by players (using the Lens item). These footsteps appear bloody if the player has killed anyone.",
    "Spectre": "An innocent who, when killed, haunts their killer. When the haunted killer dies, the Spectre respawns.",
    "Survivalist": "A special innocent that has access to the credit shop. Can see Detective location.]",
    "Trapper": "An Innocent with access to Traitor Traps. Can see ripples where a Traitor Trap has been set off. Can see Detective location.",
    "Unknown": "When killed by another player, the Unknown immediately respawns with the same role of their killer. If the Unknown fails to be killed, they will lose.",
    "Vampire": "A Traitor with no shop access. The Vampire has a Bloodlust timer. If they fail to kill at least one player a minute, they enter Bloodlust and slowly die. While in Bloodlust, the Vampire heals themself for 50% of damage they deal. The Vampire can transform into a bat (bind the Bat transformation in F1>Keybindings) and fly, but this instantly puts them into bloodlust.",
    "Vigilante": "A special Detective who gains damage boosts for killing traitors and damage reductions for killing innocents.",
    "Wrath": "A normal Innocent unless killed by another Innocent, at which point the Wrath respawns as a normal Traitor for revenge.",
    "Spy": "A special Innocent who Traitors see as a Traitor. The Spy can fake purchase items in their fake shop so that Traitors see the purchase has been made.",
    "Lycanthrope": "A special Innocent who thinks they are a normal Innocent. When the Lycanthrope is the last Innocent alive, they receive massive buffs and their role is revealed.",
    "Innocent": "An innocent player. Find and kill all the traitors or other non-innocent players. The Detective will help you.",
    "Detective": "An innocent player and leader of the group. Find and kill all the traitors or other non-innocent players. You have a shop (access with 'C' by default) from which you can purchase useful tools.",
    "Traitor": "An evil player. Find and kill all the innocents or other non-traitor players. You have a shop (access with 'C' by default) from which you can purchase useful tools.",
    "Changeling": "On its own team. The Changeling has a Mutator which allows them to steal the role of any corpse. Once they have taken the role, they remain a Changeling (they are the role they have stolen, but they remain on their own Changeling team). They also keep the Changeling's power and can change roles again as is convenient. A Changeling who has stolen a role is seen by others of that role as a teammate, even though the Changeling must eventually kill everyone.",
    "Doppelganger": "On its own team. The Doppelganger can press E on another player to steal their role, thus gaining their role's abilities. The victim becomes a normal Innocent. The Doppelganger always remains on its own team, even after role swaps. A Doppelganger who has stolen a role is seen by others of that role as a teammate, even though the Doppelganger must eventually kill everyone.",
    "Mimic": "On no team. The Mimic can press E on another player to steal their role, thus gaining their role's abilities and team. The victim becomes a normal Innocent.",
    "Banker": "A special Detective. The Banker recieves a credit any time someone else spends a credit.",
    "Ghost": "A special Innocent. When dead, a ghostly version of their character eerily follows their location while they're spectating.",
    "Drunk": "A player with no team. Each time another player is killed, there is a chance (which increases with each dead player), that the Drunk will Sober Up and assume the role of the dead player (after a timer).",
    "Hidden": "A killer on its own team. When 'R' (Reload Key) is pressed, the Hidden transforms into its killer form (announced to all): invisible, incapable of using guns, capable of climbing, stronger, and faster. Holding still grants wall hacks. They have a throwing knife and stun grenade. On taking enough damage, they become partially visible briefly",
    "Undecided": "A player with no team initially. They are shown a menu of 3 randomly selected roles to choose from at the start of the match.",
    "Astronaut": "A Detective who can use their Meeting Maker item on a body to begin a global vote on what player to kill. Voted players die instantly. Regain meeting charges each time a non-innocent dies. 3 charges required per meeting.",
    "Hunch": "A Detective who is briefly shown the perspective of anyone who dies. If multiple die at once, the Hunch takes damage.",
    "Sus": "An Innocent that has a 50/50 chance of being a Traitor. Only the Sus knows the truth, but everyone knows the Sus.",
    "Cult leader": "A villain with a Tome item that can be used on players to loudly convert them to Cultists. You can use the Tome on Cultists to heal them. Convert or kill all non-cultists.",
    "Cultist": "A converted minion of the Cult Leader. Kill all non-cultists.",
    "Thief": "A villain who steals the win whenever anyone else would have one. All players are told there is a thief at round start, and can see that you are a theif on the scoreboard.",
    "Swapper": "A Jester role who cannot win while a Swapper. If killed, the Swapper respawns immediately and swaps roles with their killer. Cannot deal damage.",
    "Seance": "An Innocent who can periodically see yellow orbs of dead/spectating players.",
    "Revolutionary": "A Detective who has access to the Traitor shop.",
    "Leech": "A teamless player who must always stand near another player to avoid depleting a bar that, once empty, begins draining health. Win with the winning team —simply survive to the end of the match (however necessary).",
    "Haunted": "Like the Spectre, but a Traitor. The Haunted haunts whoever kills them, and will respawn if said killer is subsequently killed.",
    "Elderly": "A neutral role who wins whenever someone else wins. The Elderly simply has very little health and wants only to survive til the end, by whatever means.",
    "Cursed": "A game of tag! You cannot win while Cursed. Pass the role off to another player using your tag deagle or by pressing E on someone. These actions swap your roles with the tagged player. You cannot be tagged by whoever you have just tagged.",
    "Clown": "A Jester role who, in a cloud of confetti, becomes a lone villain once only one team remains. Until then, the Clown cannot deal damage.",
    "Clairvoyant": "An Innocent who can see which players have special roles (something other than default Innocent, Traitor, or Detective) (labelled in purple) on the scoreboard.",
    "Beggar": "A Jester role who joins the team of any player who gives them an item purchased from their team's shop. Can deal no damage until then.",
    "Sacrifice": "An Innocent player who can interact with a body to sacrifice themself and revive the dead player."


}